Set up Configuration

In [3]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
# ID와 PW를 자신의 환경에 맞게 수정
%sql postgresql://id:password@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev

/usr/local/lib/python3.6/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

'Connected: ymmun@dev'

Example of Running a SQL:  
이후 아래 SQL에서 스키마는 자신의 스키마로 변경

In [5]:
%%sql

SELECT * FROM raw_data.session_timestamp LIMIT 10

 * postgresql://ymmun:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[('7cdace91c487558e27ce54df7cdb299c', datetime.datetime(2019, 5, 1, 0, 13, 11, 783000)),
 ('94f192dee566b018e0acf31e1f99a2d9', datetime.datetime(2019, 5, 1, 0, 49, 46, 73000)),
 ('7ed2d3454c5eea71148b11d0c25104ff', datetime.datetime(2019, 5, 1, 10, 18, 43, 210000)),
 ('f1daf122cde863010844459363cd31db', datetime.datetime(2019, 5, 1, 13, 10, 56, 413000)),
 ('fd0efcca272f704a760c3b61dcc70fd0', datetime.datetime(2019, 5, 1, 13, 45, 19, 793000)),
 ('8804f94e16ba5b680e239a554a08f7d2', datetime.datetime(2019, 5, 1, 14, 23, 7, 660000)),
 ('c5f441cd5f43eb2f2c024e1f8b5d00cd', datetime.datetime(2019, 5, 1, 15, 3, 54, 650000)),
 ('d5fcc35c94879a4afad61cacca56192c', datetime.datetime(2019, 5, 1, 15, 13, 16, 140000)),
 ('3d191ef6e236bd1b9bdb9ff4743c47fe', datetime.datetime(2019, 5, 1, 15, 33, 58, 197000)),
 ('c17028c9b6e0c5deaad29665d582284a', datetime.datetime(2019, 5, 1, 15, 59, 57, 490000))]

Example of Converting a SQL result into Pandas Dataframe

In [6]:
result = %sql SELECT * FROM raw_data.channel
df = result.DataFrame()

 * postgresql://ymmun:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

In [7]:
df.head()

  channelname
0     Organic
1      Google
2       Naver
3    Facebook
4     Youtube

3주차 과정 첫번째 예제

In [8]:
%%sql

CREATE TABLE ymmun.test_channel (
   channel varchar(32) primary key
);

 * postgresql://ymmun:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
(psycopg2.ProgrammingError) Relation "test_channel" already exists

[SQL: CREATE TABLE ymmun.test_channel (
   channel varchar(32) primary key
);]
(Background on this error at: http://sqlalche.me/e/13/f405)

In [ ]:
%%sql

INSERT INTO ymmun.test_channel VALUES ('FACEBOOK'), ('GOOGLE');

 * postgresql://admin:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[]

In [9]:
%%sql

SELECT * FROM ymmun.test_channel;

 * postgresql://ymmun:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[('FACEBOOK',), ('GOOGLE',)]

In [11]:
%%sql

CREATE TABLE ymmun.monthly_active_user_summary AS 
SELECT TO_CHAR(ts, 'YYYY-MM') AS month, COUNT(DISTINCT userid)
FROM raw_data.user_session_channel A
JOIN raw_data.session_timestamp B ON A.sessionid = B.sessionid
GROUP BY 1
ORDER BY 1 DESC;

 * postgresql://ymmun:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.

[]

In [12]:
%%sql

SELECT * FROM ymmun.monthly_active_user_summary;

 * postgresql://ymmun:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-11', 721),
 ('2019-08', 662),
 ('2019-10', 763),
 ('2019-09', 639),
 ('2019-07', 623),
 ('2019-06', 459),
 ('2019-05', 281)]

In [13]:
%%sql

DROP TABLE ymmun.monthly_active_user_summary;

 * postgresql://ymmun:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.

[]

In [14]:
%%sql

ALTER TABLE ymmun.test_channel RENAME channel to channelname;

 * postgresql://ymmun:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.

[]

In [15]:
%%sql

SELECT * FROM ymmun.test_channel # channel -> channelname 으로 변경

 * postgresql://ymmun:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[('FACEBOOK',), ('GOOGLE',)]

In [16]:
%%sql

SELECT COUNT(1)
FROM raw_data.user_session_channel
WHERE channel in ('Google','Facebook');

 * postgresql://ymmun:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(33773,)]

In [20]:
%%sql

SELECT * FROM raw_data.user_session_channel limit 10

 * postgresql://ymmun:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(184, 'c41dd99a69df04044aa4e33ece9c9249', 'Naver'),
 (80, 'fdc0eb412a84fa549afe68373d9087e9', 'Organic'),
 (251, '0a54b19a13b6712dc04d1b49215423d8', 'Facebook'),
 (264, 'a914ecef9c12ffdb9bede64bb703d877', 'Google'),
 (744, '05ae14d7ae387b93370d142d82220f1b', 'Facebook'),
 (229, 'eddeb82df22554fa67c641e3f8a25566', 'Google'),
 (265, '4c4ea5258ef3fb3fb1fc48fee9b4408c', 'Naver'),
 (80, '8ae1da0fe37c98412768453f82490da2', 'Organic'),
 (45, '60131a2a3f223dc8f4753bcc5771660c', 'Youtube'),
 (198, '90f4760fcc9b69c13da7368c5c2917f3', 'Facebook')]

In [21]:
%%sql

SELECT * FROM raw_data.channel limit 10

 * postgresql://ymmun:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('Naver',),
 ('Facebook',),
 ('Youtube',),
 ('Instagram',),
 ('TIKTOK',),
 ('Organic',),
 ('Google',)]

In [155]:
%%sql
-- assignment 1 슬라이드 32

SELECT channelname, count(distinct userid) as cnt_user
FROM raw_data.channel as t1 left join raw_data.user_session_channel as t2
ON t1.channelname = t2.channel
GROUP BY 1

 * postgresql://ymmun:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('Instagram', 895),
 ('Naver', 882),
 ('Youtube', 889),
 ('Facebook', 889),
 ('TIKTOK', 0),
 ('Organic', 895),
 ('Google', 893)]

In [154]:
%%sql
-- assignment 1 슬라이드 41

SELECT distinct userid, first_value(channel) over(partition by userid order by ts asc rows between unbounded preceding and unbounded following) as first_channel
  , first_value(channel) over(partition by userid order by ts desc rows between unbounded preceding and unbounded following) as last_channel
FROM raw_data.user_session_channel as t1 JOIN raw_data.session_timestamp t2
ON t1.sessionid = t2.sessionid
limit 10

 * postgresql://ymmun:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(27, 'Youtube', 'Instagram'),
 (29, 'Naver', 'Naver'),
 (33, 'Google', 'Youtube'),
 (40, 'Youtube', 'Google'),
 (44, 'Naver', 'Instagram'),
 (68, 'Youtube', 'Organic'),
 (191, 'Naver', 'Instagram'),
 (196, 'Facebook', 'Naver'),
 (197, 'Naver', 'Youtube'),
 (210, 'Google', 'Google')]

In [111]:
%%sql
-- assignment 2

SELECT userid, sum(amount) as sum_amount
FROM raw_data.user_session_channel as t1 JOIN raw_data.session_transaction as t2  --가장 큰 매출계산 TOP 10 이므로 JOIN, LEFT JOIN 상관 없다
ON t1.sessionid = t2.sessionid
GROUP BY 1
order by 2 desc
limit 10

 * postgresql://ymmun:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(989, 743),
 (772, 556),
 (1615, 506),
 (654, 488),
 (1651, 463),
 (973, 438),
 (262, 422),
 (1099, 421),
 (2682, 414),
 (891, 412)]

In [127]:
%%sql
-- assignment 3

create table ymmun.assignment3 as 
(
SELECT TO_CHAR(ts, 'YYYY-MM') as month, channelname as channel, count(distinct userid) as uniqueUsers --tiktok 조심
    , count(t4.sessionid) as paidUsers
    , case when count(distinct userid) = 0 then 0
           else cast(count(t4.sessionid) as float)/ count(distinct userid) end as conversionRate
    , sum(amount) as grossRevenue
    , sum(case when refunded = False then amount end) as netRevenue
FROM 
  raw_data.channel as t1 
  LEFT JOIN 
  raw_data.user_session_channel as t2
  ON t1.channelname = t2.channel
  LEFT JOIN raw_data.session_timestamp as t3
  ON t2.sessionid = t3.sessionid
  LEFT JOIN raw_data.session_transaction as t4
  ON t2.sessionid = t4.sessionid
GROUP BY 1, 2
order by 1, 2
)

 * postgresql://ymmun:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.

[]